<a href="https://colab.research.google.com/github/Snakesystem/Google-Colab/blob/main/Experimen_pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## Import library

In [1]:
import pandas as pd
import numpy as np

## Manipulating Data with Series

In [2]:
s = pd.Series([3, -5, 7, 4], index=['a', 'b', 'c', 'd']) # membuat 1 kolom dengan berindex a, b, c, d
s

a    3
b   -5
c    7
d    4
dtype: int64

In [3]:
series = pd.Series([1, 0.5, 4, 5.5, 'lima']) # membuat 1 kolom yang berisi beberapa type data
series

0       1
1     0.5
2       4
3     5.5
4    lima
dtype: object

In [4]:
ss = pd.Series([1.4, 5.6, 3, 3, 6], [1, 2, -3, 4, 5])
ss

 1    1.4
 2    5.6
-3    3.0
 4    3.0
 5    6.0
dtype: float64

### Mengambil atau memilih kolom tertentu pada series

In [5]:
s
# Memanggil pada code 2

a    3
b   -5
c    7
d    4
dtype: int64

In [6]:
s[~(s > 1)] # mengambil nilai, dimana negasi dari s > 1 atau s bukan > 1

b   -5
dtype: int64

In [7]:
s[(s < -1) | (s > 3)] # mengambil nilai, dimana s < -1 atau s > 3

b   -5
c    7
d    4
dtype: int64

In [12]:
# Lihat code2 bahwa indeks "a"=3, kemudian diganti dengan 6 menggunakan perintah dibawah ini
s['a'] = 6 # Mengganti variabel dengan 
s

a    6
b   -5
c    8
d    4
dtype: int64

In [13]:
s['c'] = 8 # Mengganti indeks "c" dengan angka 8
s

a    6
b   -5
c    8
d    4
dtype: int64

In [10]:
s.drop(['a', 'c']) # menghapus label a dan c

b   -5
d    4
dtype: int64

## Manipulating Data with Data Frame

### Membuat dataframe dari suatu series

In [11]:
# Lihatlah code4 kemudian mengubah menjadi data frame sebagai berikut
df1 = pd.DataFrame(ss)
df1

      0
 1  1.4
 2  5.6
-3  3.0
 4  3.0
 5  6.0

### Membuat dataframe dengan key dan value

In [14]:
data = {'Country': ['Belgium', 'India', 'Brazil'], 'Capital': ['Brussels', 'New Delhi', 'Brasília'], 'Population': [11190846, 1303171035, 207847528]}
df = pd.DataFrame(data, columns=['Country', 'Capital', 'Population'])
df

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasília   207847528

### Selection

In [15]:
s['b'] # memilih var s index b

-5

In [16]:
df[1:] # memilih kolom 1 sampai terakhir

  Country    Capital  Population
1   India  New Delhi  1303171035
2  Brazil   Brasília   207847528

In [17]:
df.iloc[[0],[0]] # memilih kolom index 0 dan baris 0

   Country
0  Belgium

In [18]:
df.iloc[1:,[0]] # memilih kolom 1 sampai terakhir, dan baris index ke-0

  Country
1   India
2  Brazil

In [19]:
df.iat[0,0] # memilih baris index 0 dan kolom 0

'Belgium'

In [20]:
df.iat[1,0] # memilih baris index 1 dan kolom 0

'India'

In [21]:
df.loc[[0], ['Country']] # memilih baris index ke-0 pada kolom Country

   Country
0  Belgium

In [22]:
df.loc[:,['Capital']] # memilih baris semua index pada kolom Capital

     Capital
0   Brussels
1  New Delhi
2   Brasília

In [23]:
df.at[0,'Country'] # sama halnya dengan .loc tetapi bedanya 0 merupakan nilai skalar, jadi pengambilan nilai hanya satu

'Belgium'

In [24]:
df.at[1,'Capital']

'New Delhi'

In [25]:
df[df['Population'] > 1200000000] # memilih baris (atau kolom) dengan populasi >  1,2 M

  Country    Capital  Population
1   India  New Delhi  1303171035

In [26]:
# df.ix[1,'Capital']
df.loc[1,'Capital']

'New Delhi'

Atribut dan Method Data Frame lainnya

In [28]:
# Memanggil dari code14
df

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasília   207847528

In [29]:
df.drop('Country', axis=1) # menghapus kolom Country

     Capital  Population
0   Brussels    11190846
1  New Delhi  1303171035
2   Brasília   207847528

In [30]:
df.sort_index() # mengurutkan berdasarkan index

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasília   207847528

In [31]:
df.rank() # menentukan peringkat

   Country  Capital  Population
0      1.0      2.0         1.0
1      3.0      3.0         3.0
2      2.0      1.0         2.0

In [32]:
df.sort_values(by='Country') # mengurutkan kolom Country berdasarkan nilai

   Country    Capital  Population
0  Belgium   Brussels    11190846
2   Brazil   Brasília   207847528
1    India  New Delhi  1303171035

In [33]:
df.shape # untuk mengetahui jumlah baris dan kolom

(3, 3)

In [34]:
df.index # untuk mengetahui index

RangeIndex(start=0, stop=3, step=1)

In [35]:
df.columns # untuk mengetahui nilai

Index(['Country', 'Capital', 'Population'], dtype='object')

In [36]:
df.info() # untuk mengetahui info

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Country     3 non-null      object
 1   Capital     3 non-null      object
 2   Population  3 non-null      int64
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

In [37]:
df.count() # menghitung jumlah elemen bukan NA / None

Country       3
Capital       3
Population    3
dtype: int64

In [38]:
df.sum() # menentukan jumlah

Country              BelgiumIndiaBrazil
Capital       BrusselsNew DelhiBrasília
Population                   1522209409
dtype: object

In [40]:
df.cumsum() # menentukan jumlah komulatif berdasarkan grup

              Country                    Capital  Population
0             Belgium                   Brussels    11190846
1        BelgiumIndia          BrusselsNew Delhi  1314361881
2  BelgiumIndiaBrazil  BrusselsNew DelhiBrasília  1522209409

In [41]:
df.min() # menentukan nilai minimum

Country        Belgium
Capital       Brasília
Population    11190846
dtype: object

In [42]:
df.max() # menentukan nilai maximum

Country            India
Capital        New Delhi
Population    1303171035
dtype: object

In [43]:
df.describe() # menampilkan statistik data

         Population
count  3.000000e+00
mean   5.074031e+08
std    6.961346e+08
min    1.119085e+07
25%    1.095192e+08
50%    2.078475e+08
75%    7.555093e+08
max    1.303171e+09

In [44]:
df.mean() # menentukan rata-rata

Population    5.074031e+08
dtype: float64

In [45]:
df.median() # menentukan nilai tengah

Population    207847528.0
dtype: float64

### Mengimport Data ke Data Frame

In [46]:
#Contoh mengimport dari web
url = 'https://people.sc.fsu.edu/~jburkardt/data/csv/freshman_kgs.csv'
df2 = pd.read_csv(url)

df2

   Sex   "Weight (Sep)"   "Weight (Apr)"   "BMI (Sep)"   "BMI (Apr)"
0    M               72               59         22.02         18.14
1    M               97               86         19.70         17.44
2    M               74               69         24.09         22.43
3    M               93               88         26.97         25.57
4    F               68               64         21.51         20.10
..  ..              ...              ...           ...           ...
62   M               65               71         22.51         24.45
63   M               75               82         23.69         25.80
64   F               42               49         15.08         17.74
65   M               74               82         22.64         25.33
66   M               94              105         36.57         40.86

[67 rows x 5 columns]

In [49]:
# Cara mengambil data dari kaggle
california = '/content/sample_data/california_housing_test.csv'
data = pd.read_csv(california)

data

      longitude  latitude  ...  median_income  median_house_value
0       -122.05     37.37  ...         6.6085            344700.0
1       -118.30     34.26  ...         3.5990            176500.0
2       -117.81     33.78  ...         5.7934            270500.0
3       -118.36     33.82  ...         6.1359            330000.0
4       -119.67     36.33  ...         2.9375             81700.0
...         ...       ...  ...            ...                 ...
2995    -119.86     34.42  ...         1.1790            225000.0
2996    -118.14     34.06  ...         3.3906            237200.0
2997    -119.70     36.30  ...         2.2895             62000.0
2998    -117.12     34.10  ...         3.2708            162500.0
2999    -119.63     34.42  ...         8.5608            500001.0

[3000 rows x 9 columns]

In [50]:
data.tail()

      longitude  latitude  ...  median_income  median_house_value
2995    -119.86     34.42  ...         1.1790            225000.0
2996    -118.14     34.06  ...         3.3906            237200.0
2997    -119.70     36.30  ...         2.2895             62000.0
2998    -117.12     34.10  ...         3.2708            162500.0
2999    -119.63     34.42  ...         8.5608            500001.0

[5 rows x 9 columns]

In [51]:
data.columns

Index(['longitude', 'latitude', 'housing_median_age', 'total_rooms',
       'total_bedrooms', 'population', 'households', 'median_income',
       'median_house_value'],
      dtype='object')

In [52]:
data.describe

<bound method NDFrame.describe of       longitude  latitude  ...  median_income  median_house_value
0       -122.05     37.37  ...         6.6085            344700.0
1       -118.30     34.26  ...         3.5990            176500.0
2       -117.81     33.78  ...         5.7934            270500.0
3       -118.36     33.82  ...         6.1359            330000.0
4       -119.67     36.33  ...         2.9375             81700.0
...         ...       ...  ...            ...                 ...
2995    -119.86     34.42  ...         1.1790            225000.0
2996    -118.14     34.06  ...         3.3906            237200.0
2997    -119.70     36.30  ...         2.2895             62000.0
2998    -117.12     34.10  ...         3.2708            162500.0
2999    -119.63     34.42  ...         8.5608            500001.0

[3000 rows x 9 columns]>

In [53]:
data.dtypes

longitude             float64
latitude              float64
housing_median_age    float64
total_rooms           float64
total_bedrooms        float64
population            float64
households            float64
median_income         float64
median_house_value    float64
dtype: object

In [54]:
# Menganalisis Data mulai dari sini

# Thanks Gaes